

*** Limiting to Faces Defined in `faces.el`
To ensure that only Emacs built-in faces defined in `faces.el` are included, we can filter the faces by checking if their definitions originate from the `faces` feature. This approach ensures that we only include faces that are part of Emacs's core.

Below is the updated script:

#+BEGIN_SRC emacs-lisp
  (defun kebab-to-pascal-case (str)
    "Convert a kebab-case string STR to PascalCase."
    (let ((case-fold-search nil))
      (mapconcat #'capitalize (split-string str "-") "")))

  (defun is-face-from-faces-feature (face)
  	"Check if FACE is defined in the `faces` feature."
  	(let ((location (symbol-file face)))
  		(and location (or
  						  (string-match-p "faces" location)
  						  (string-match-p "tab-bar" location)
  						  (string-match-p "orderless" location)
  						  (string-match-p "ansi-color" location)
  						  (string-match-p "font-lock" location)))))

  (defun extract-faces-el-theme-colors-pascal-case ()
    "Extract face colors from `faces.el` and format them with PascalCase names."
    (interactive)
    (let ((output ""))
      (mapatoms
       (lambda (face)
         (when (and (facep face) (is-face-from-faces-feature face))
           (let ((fg (or (face-foreground face nil t) "#000000"))
                 (bg (or (face-background face nil t) "#000000"))
                 (pascal-case-name (kebab-to-pascal-case (symbol-name face))))
             (setq output (concat output
                                  (format "fg%s = \"%s\";\n" pascal-case-name fg)
                                  (format "bg%s = \"%s\";\n" pascal-case-name bg)))))))
      (with-current-buffer (get-buffer-create "*Faces.el Theme Colors*")
        (erase-buffer)
        (insert output)
        (pop-to-buffer (current-buffer)))))

  (extract-faces-el-theme-colors-pascal-case)
#+END_SRC

#+RESULTS:
: #<buffer *Faces.el Theme Colors*>

